:PROPERTIES:
:ID:       3cad4156-34eb-4e1f-82e4-46775015a546
:END:
#+title: 八股
#+filetags: interview

* 未归档
#+name: sizeof 和 strlen 的区别
#+begin_src C
#include <stdio.h>
#include <string.h>

int main(int argc, char* argv[]) {
    unsigned char a[] = {'a', 'b', 0, 'c'};  // 这里面的0就是 '\0'
    printf("%d, %d", sizeof(a), strlen(a));  // sizeof计算变量或数据类型所占直接数，因此会计算a数组大小；strlen计算字符串长度，统计到第一个'\0'，且不包含'\0'
}
#+end_src

#+RESULTS:
| 4 | 2 |


